{
  "skills": [
    {
      "name": "Adaptability",
      "level": "5",
      "description": "One of my greatest strengths is picking up a new technology and putting it to work. As a full stack 'generalist', I find this skill to be critical in my daily workflow."
    },
    {
      "name": "RTFM",
      "level": "5",
      "description": "Reading the Freaking Manual: One of the few skills I have continually used, and aquired near mastery of. Quickly finding, and 'Groking' information has proven to be critical when working across a multitude of technologies on a regular basis."
    },
    {
      "name": "JavaScript",
      "level": "4",
      "description": "I'm quite adept and comfortable with modern JavaScript including: Legacy, ES6, and some of ESNext. I have been tinkering with JS almost since it was first created, and while I still to check documention regularly (who has the memory not to?), I am very familiar with it's constructs, as well as employing the good parts, while avoiding the bad (I'm looking at you 'this')."
    },
    {
      "name": "CSS/SCSS",
      "level": "3",
      "description": "I know my way around css and scss, and can generally get things positioned the way I need, particularly when using a library like bulma or bootstrap. I have dabbled with BEM naming. All of that said, design is not my strong suite. I can generally get things laid out and working responsively, but it likely wont be the most attractive thing you ever saw! My concept of color schemes is pretty attrocioius."
    },
    {
      "name": "Node.js",
      "level": "3",
      "description": "While node is ultimately JavaScript, there are absolutely some differences between working on front-end javascript and backend node, so I think it's worth mentioning. It has been a while since I've done any heavy back end work, but I have built a few pure node.js projects, and am capable of doing it when needed."
    },
    {
      "name": "React/Redux",
      "level": "3",
      "description": "I have build a few projects recently using React/Redux and am quite familiar with the pattern. It's a nice way to build in JavaScript, and I'm quite comfortable working with these libraries."
    },
    {
      "name": "Git",
      "level": "3",
      "description": "If I'm coding, I'm using git, and have been for many years now. It's an amazing tool and I'm quite comfortable employing commits, amends, pulls, clones, forks, etc. Addmittedly its been a while since I've done any pull-requests or rebases - but I'm sure it will come right back to me."
    },
    {
      "name": "DevOps",
      "level": "2",
      "description": "When it comes to linux and VPS setups, I am quite comfortable and capable of locking a system down, configuring and employing services, but my experience with 'cloud' services is pretty much limited to a bit of poking around with dropbox, heroku, aws, azure services. I would love to get some more experience in this area."
    },
    {
      "name": "Databases",
      "level": "2",
      "description": "I have used both SQL and noSQL databases over the years, and while It's been a while since I've done anything with one, I am certainly capable of setting up some tables, models, and creating basic interactions. I have a general grasp of relational models and normalization practices. This is one of those things where If I had to, I could get it working, but most likely it would need some refinement and optimizations."
    },
    {
      "name": "Algorithms and Data Structures",
      "level": "2",
      "description": "I have done some basic study in this area. I certainly understand Big O notation, and can generally determine if an algo falls within Constant, Linear, Quadratic or Logarithmic time. If its more mathmatically complex than one of those, I probably wouldnt be able to name it. I definitely will not be writing any ground breaking algos - but I generaly know enough to find one thats appropriate for my needs. Same goes for data structures - I wont be hand-coding any binary-search-trees, but I'll know when I need one, and how to find one that is well-implemented and tested."
    },
    {
      "name": "TDD",
      "level": "3",
      "description": "While I have created several projects using Test Driven Development, I still find it to be a bit of a departure from my default mode of coding. That said, I definitely see the value of the test first approach, as it forces you to really think about your design. TDD has also helped me appreciate functional programming more, as pure functions really make the testing process much less painful. I would love to be in an environment where I got to do more of it."
    },
    {
      "name": "",
      "level": "",
      "description": ""
    }
  ]
}
